# ==============================
# Налаштування
# ==============================
IMAGE=flavel/nhl_project
TAG=latest
CONTAINER=nhl_parser

# ==============================
# Build образу
# ==============================
build:
	docker build -t $(IMAGE):$(TAG) .

# ==============================
# Запуск контейнера (Django)
# ==============================
run:
	docker run -d -p 8000:8000 --name $(CONTAINER) $(IMAGE):$(TAG)

# ==============================
# Зупинка контейнера
# ==============================
stop:
	docker stop $(CONTAINER) || true
	docker rm $(CONTAINER) || true

# ==============================
# Перезапуск (оновити контейнер)
# ==============================
restart: stop run

# ==============================
# Логи
# ==============================
logs:
	docker logs -f $(CONTAINER)

# ==============================
# Запуск update_data.py
# ==============================
update:
	docker exec -it $(CONTAINER) python myproject/update_data.py

# ==============================
# Пуш на Docker Hub
# ==============================
push:
	docker push $(IMAGE):$(TAG)

# ==============================
# Повний цикл
# ==============================
all: build stop run
